Masmiseim36/nxpSDK/devices/MIMXRT758S/MIMXRT758S_ezhv.xml
        <register>
          <name>LP_DENY0</name>
          <description>Low-Power Request Deny Status 0</description>
          <addressOffset>0x1F4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LP_FLEXCOMM0_LPDENY</name>
              <description>LP_FLEXCOMM0 Low-Power Deny Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_LPDENY</name>
                  <description>Not deny</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPDENY</name>
                  <description>Deny</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM1_LPDENY</name>
              <description>LP_FLEXCOMM1 Low-Power Deny Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_LPDENY</name>
                  <description>Not deny</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPDENY</name>
                  <description>Deny</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM2_LPDENY</name>
              <description>LP_FLEXCOMM2 Low-Power Deny Status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_LPDENY</name>
                  <description>Not deny</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPDENY</name>
                  <description>Deny</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM3_LPDENY</name>
              <description>LP_FLEXCOMM3 Low-Power Deny Status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_LPDENY</name>
                  <description>Not deny</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPDENY</name>
                  <description>Deny</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM4_LPDENY</name>
              <description>LP_FLEXCOMM4 Low-Power Deny Status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_LPDENY</name>
                  <description>Not deny</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPDENY</name>
                  <description>Deny</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM5_LPDENY</name>
              <description>LP_FLEXCOMM5 Low-Power Deny Status</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_LPDENY</name>
                  <description>Not deny</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPDENY</name>
                  <description>Deny</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM6_LPDENY</name>
              <description>LP_FLEXCOMM6 Low-Power Deny Status</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_LPDENY</name>
                  <description>Not deny</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPDENY</name>
                  <description>Deny</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM7_LPDENY</name>
              <description>LP_FLEXCOMM7 Low-Power Deny Status</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_LPDENY</name>
                  <description>Not deny</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPDENY</name>
                  <description>Deny</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM8_LPDENY</name>
              <description>LP_FLEXCOMM8 Low-Power Deny Status</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_LPDENY</name>
                  <description>Not deny</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPDENY</name>
                  <description>Deny</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM9_LPDENY</name>
              <description>LP_FLEXCOMM9 Low-Power Deny Status</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_LPDENY</name>
                  <description>Not deny</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPDENY</name>
                  <description>Deny</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM10_LPDENY</name>
              <description>LP_FLEXCOMM10 Low-Power Deny Status</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_LPDENY</name>
                  <description>Not deny</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPDENY</name>
                  <description>Deny</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM11_LPDENY</name>
              <description>LP_FLEXCOMM11 Low-Power Deny Status</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_LPDENY</name>
                  <description>Not deny</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPDENY</name>
                  <description>Deny</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM12_LPDENY</name>
              <description>LP_FLEXCOMM12 Low-Power Deny Status</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_LPDENY</name>
                  <description>Not deny</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPDENY</name>
                  <description>Deny</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM13_LPDENY</name>
              <description>LP_FLEXCOMM13 Low-Power Deny Status</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_LPDENY</name>
                  <description>Not deny</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPDENY</name>
                  <description>Deny</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSPI14_LPDENY</name>
              <description>LPSPI14 Low-Power Deny Status</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_LPDENY</name>
                  <description>Not deny</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPDENY</name>
                  <description>Deny</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSPI16_LPDENY</name>
              <description>LPSPI16 Low-Power Deny Status</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_LPDENY</name>
                  <description>Not deny</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPDENY</name>
                  <description>Deny</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXIO_LPDENY</name>
              <description>FLEXIO Low-Power Deny Status</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_LPDENY</name>
                  <description>Not deny</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPDENY</name>
                  <description>Deny</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPI2C15_LPDENY</name>
              <description>LPI2C15 Low-Power Deny Status</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_LPDENY</name>
                  <description>Not deny</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPDENY</name>
                  <description>Deny</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
