Masmiseim36/nxpSDK/devices/MIMXRT758S/MIMXRT758S_ezhv.xml
        <register>
          <name>OTP_SHADOW_PARTB240</name>
          <description>OTP shadow register</description>
          <addressOffset>0x3C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB241</name>
          <description>OTP shadow register</description>
          <addressOffset>0x3C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB242</name>
          <description>OTP shadow register</description>
          <addressOffset>0x3C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB243</name>
          <description>OTP shadow register</description>
          <addressOffset>0x3CC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB244</name>
          <description>OTP shadow register</description>
          <addressOffset>0x3D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB245</name>
          <description>OTP shadow register</description>
          <addressOffset>0x3D4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB246</name>
          <description>OTP shadow register</description>
          <addressOffset>0x3D8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB247</name>
          <description>OTP shadow register</description>
          <addressOffset>0x3DC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB248</name>
          <description>OTP shadow register</description>
          <addressOffset>0x3E0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB249</name>
          <description>OTP shadow register</description>
          <addressOffset>0x3E4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB250</name>
          <description>OTP shadow register</description>
          <addressOffset>0x3E8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB251</name>
          <description>OTP shadow register</description>
          <addressOffset>0x3EC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB252</name>
          <description>OTP shadow register</description>
          <addressOffset>0x3F0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB253</name>
          <description>OTP shadow register</description>
          <addressOffset>0x3F4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB254</name>
          <description>OTP shadow register</description>
          <addressOffset>0x3F8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB255</name>
          <description>OTP shadow register</description>
          <addressOffset>0x3FC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB256</name>
          <description>OTP shadow register</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB257</name>
          <description>OTP shadow register</description>
          <addressOffset>0x404</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB258</name>
          <description>OTP shadow register</description>
          <addressOffset>0x408</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB259</name>
          <description>OTP shadow register</description>
          <addressOffset>0x40C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB260</name>
          <description>OTP shadow register</description>
          <addressOffset>0x410</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB261</name>
          <description>OTP shadow register</description>
          <addressOffset>0x414</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB262</name>
          <description>OTP shadow register</description>
          <addressOffset>0x418</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB263</name>
          <description>OTP shadow register</description>
          <addressOffset>0x41C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB264</name>
          <description>OTP shadow register</description>
          <addressOffset>0x420</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB265</name>
          <description>OTP shadow register</description>
          <addressOffset>0x424</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB266</name>
          <description>OTP shadow register</description>
          <addressOffset>0x428</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB267</name>
          <description>OTP shadow register</description>
          <addressOffset>0x42C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB268</name>
          <description>OTP shadow register</description>
          <addressOffset>0x430</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB269</name>
          <description>OTP shadow register</description>
          <addressOffset>0x434</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB270</name>
          <description>OTP shadow register</description>
          <addressOffset>0x438</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB271</name>
          <description>OTP shadow register</description>
          <addressOffset>0x43C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB272</name>
          <description>OTP shadow register</description>
          <addressOffset>0x440</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB273</name>
          <description>OTP shadow register</description>
          <addressOffset>0x444</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
