Masmiseim36/nxpSDK/devices/MIMXRT758S/MIMXRT758S_ezhv.xml
        <register>
          <name>PIO8_22</name>
          <description>IOPCTL Configuration</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FSEL</name>
              <description>Function Selector (Digital Function)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FSEL_0</name>
                  <description>Function 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSEL_1</name>
                  <description>Function 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSEL_2</name>
                  <description>Function 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSEL_3</name>
                  <description>Function 3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSEL_4</name>
                  <description>Function 4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSEL_5</name>
                  <description>Function 5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSEL_6</name>
                  <description>Function 6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSEL_7</name>
                  <description>Function 7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUPDENA</name>
              <description>Pullup / Pulldown Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PUPDENA_0</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUPDENA_1</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUPDSEL</name>
              <description>Pullup or Pulldown Selector</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PUPDSEL_0</name>
                  <description>Enables the internal pull-down resistor.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUPDSEL_1</name>
                  <description>Enables the internal pull-up resistor.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IBENA</name>
              <description>Input Buffer Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IBENA_0</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IBENA_1</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLEWRATE</name>
              <description>Slew Rate Control</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLEWRATE_0</name>
                  <description>Disables. Standard mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLEWRATE_1</name>
                  <description>Enables. Slow mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AMENA</name>
              <description>Analog Mux Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AMENA_0</name>
                  <description>Disables for digital pin function</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AMENA_1</name>
                  <description>Enables for analog pin function</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ODENA</name>
              <description>Open-drain Mode Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ODENA_0</name>
                  <description>Disables for Normal push-pull output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ODENA_1</name>
                  <description>Enables for open-drain output (high drive is disabled)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IIENA</name>
              <description>Input Invert Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IIENA_0</name>
                  <description>Disables. Input function is not inverted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IIENA_1</name>
                  <description>Enables, input is function inverted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DRIVE</name>
              <description>Drive Selector</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DRIVE_0</name>
                  <description>Normal output drive</description>
                  <value>#x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DRIVE_1</name>
                  <description>Full output drive, twice the drive of normal mode.</description>
                  <value>#x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PIO8_23</name>
          <description>IOPCTL Configuration</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FSEL</name>
              <description>Function Selector (Digital Function)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FSEL_0</name>
                  <description>Function 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSEL_1</name>
                  <description>Function 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSEL_2</name>
                  <description>Function 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSEL_3</name>
                  <description>Function 3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSEL_4</name>
                  <description>Function 4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSEL_5</name>
                  <description>Function 5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSEL_6</name>
                  <description>Function 6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSEL_7</name>
                  <description>Function 7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUPDENA</name>
              <description>Pullup / Pulldown Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PUPDENA_0</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUPDENA_1</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUPDSEL</name>
              <description>Pullup or Pulldown Selector</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PUPDSEL_0</name>
                  <description>Enables the internal pull-down resistor.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUPDSEL_1</name>
                  <description>Enables the internal pull-up resistor.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IBENA</name>
              <description>Input Buffer Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IBENA_0</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IBENA_1</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLEWRATE</name>
              <description>Slew Rate Control</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLEWRATE_0</name>
                  <description>Disables. Standard mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLEWRATE_1</name>
                  <description>Enables. Slow mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AMENA</name>
              <description>Analog Mux Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AMENA_0</name>
                  <description>Disables for digital pin function</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AMENA_1</name>
                  <description>Enables for analog pin function</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ODENA</name>
              <description>Open-drain Mode Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ODENA_0</name>
                  <description>Disables for Normal push-pull output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ODENA_1</name>
                  <description>Enables for open-drain output (high drive is disabled)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IIENA</name>
              <description>Input Invert Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IIENA_0</name>
                  <description>Disables. Input function is not inverted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IIENA_1</name>
                  <description>Enables, input is function inverted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DRIVE</name>
              <description>Drive Selector</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DRIVE_0</name>
                  <description>Normal output drive</description>
                  <value>#x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DRIVE_1</name>
                  <description>Full output drive, twice the drive of normal mode.</description>
                  <value>#x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
