Masmiseim36/nxpSDK/devices/MIMXRT758S/MIMXRT758S_ezhv.xml
        <register>
          <name>PIO5_9</name>
          <description>IOPCTL Configuration</description>
          <addressOffset>0xA4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FSEL</name>
              <description>Function Selector (Digital Function)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FSEL_0</name>
                  <description>Function 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSEL_1</name>
                  <description>Function 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSEL_2</name>
                  <description>Function 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSEL_3</name>
                  <description>Function 3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSEL_4</name>
                  <description>Function 4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSEL_5</name>
                  <description>Function 5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSEL_6</name>
                  <description>Function 6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSEL_7</name>
                  <description>Function 7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUPDENA</name>
              <description>Pullup / Pulldown Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PUPDENA_0</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUPDENA_1</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUPDSEL</name>
              <description>Pullup or Pulldown Selector</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PUPDSEL_0</name>
                  <description>Enables the internal pull-down resistor.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUPDSEL_1</name>
                  <description>Enables the internal pull-up resistor.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IBENA</name>
              <description>Input Buffer Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IBENA_0</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IBENA_1</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ODENA</name>
              <description>Open-drain Mode Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ODENA_0</name>
                  <description>Disables for normal push-pull output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ODENA_1</name>
                  <description>Enables for simulated open-drain output (high drive disabled)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IIENA</name>
              <description>Input Invert Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IIENA_0</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IIENA_1</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DRIVE</name>
              <description>Drive</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DRIVE00</name>
                  <description>100 ohm</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DRIVE01</name>
                  <description>66 ohm</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DRIVE10</name>
                  <description>50 ohm</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DRIVE11</name>
                  <description>33 ohm</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PIO5_10</name>
          <description>IOPCTL Configuration</description>
          <addressOffset>0xA8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FSEL</name>
              <description>Function Selector (Digital Function)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FSEL_0</name>
                  <description>Function 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSEL_1</name>
                  <description>Function 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSEL_2</name>
                  <description>Function 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSEL_3</name>
                  <description>Function 3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSEL_4</name>
                  <description>Function 4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSEL_5</name>
                  <description>Function 5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSEL_6</name>
                  <description>Function 6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSEL_7</name>
                  <description>Function 7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUPDENA</name>
              <description>Pullup / Pulldown Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PUPDENA_0</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUPDENA_1</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUPDSEL</name>
              <description>Pullup or Pulldown Selector</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PUPDSEL_0</name>
                  <description>Enables the internal pull-down resistor.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUPDSEL_1</name>
                  <description>Enables the internal pull-up resistor.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IBENA</name>
              <description>Input Buffer Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IBENA_0</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IBENA_1</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ODENA</name>
              <description>Open-drain Mode Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ODENA_0</name>
                  <description>Disables for normal push-pull output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ODENA_1</name>
                  <description>Enables for simulated open-drain output (high drive disabled)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IIENA</name>
              <description>Input Invert Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IIENA_0</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IIENA_1</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DRIVE</name>
              <description>Drive</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DRIVE00</name>
                  <description>100 ohm</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DRIVE01</name>
                  <description>66 ohm</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DRIVE10</name>
                  <description>50 ohm</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DRIVE11</name>
                  <description>33 ohm</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PIO5_11</name>
          <description>IOPCTL Configuration</description>
          <addressOffset>0xAC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x30</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FSEL</name>
              <description>Function Selector (Digital Function)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FSEL_0</name>
                  <description>Function 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSEL_1</name>
                  <description>Function 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSEL_2</name>
                  <description>Function 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSEL_3</name>
                  <description>Function 3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSEL_4</name>
                  <description>Function 4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSEL_5</name>
                  <description>Function 5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSEL_6</name>
                  <description>Function 6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSEL_7</name>
                  <description>Function 7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUPDENA</name>
              <description>Pullup / Pulldown Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PUPDENA_0</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUPDENA_1</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUPDSEL</name>
              <description>Pullup or Pulldown Selector</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PUPDSEL_0</name>
                  <description>Enables the internal pull-down resistor.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUPDSEL_1</name>
                  <description>Enables the internal pull-up resistor.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IBENA</name>
              <description>Input Buffer Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IBENA_0</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IBENA_1</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ODENA</name>
              <description>Open-drain Mode Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ODENA_0</name>
                  <description>Disables for normal push-pull output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ODENA_1</name>
                  <description>Enables for simulated open-drain output (high drive disabled)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IIENA</name>
              <description>Input Invert Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IIENA_0</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IIENA_1</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DRIVE</name>
              <description>Drive</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DRIVE00</name>
                  <description>100 ohm</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DRIVE01</name>
                  <description>66 ohm</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DRIVE10</name>
                  <description>50 ohm</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DRIVE11</name>
                  <description>33 ohm</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
