Masmiseim36/nxpSDK/devices/MIMXRT758S/MIMXRT758S_ezhv.xml
        <register>
          <dim>128</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>MTCBR[%s]</name>
          <description>Controller Transmit Command Burst</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CMD</name>
              <description>Command</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>253</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>MTDBR[%s]</name>
          <description>Transmit Data Burst</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA0</name>
              <description>Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DATA1</name>
              <description>Data</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DATA2</name>
              <description>Data</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DATA3</name>
              <description>Data</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="LPI2C0">
      <name>LPI2C1</name>
      <description>Low-Power Inter-Integrated Circuit</description>
      <groupName>LPI2C</groupName>
      <baseAddress>0x40111800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x7F4</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="LPI2C0">
      <name>LPI2C2</name>
      <description>Low-Power Inter-Integrated Circuit</description>
      <groupName>LPI2C</groupName>
      <baseAddress>0x40112800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x7F4</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="LPI2C0">
      <name>LPI2C3</name>
      <description>Low-Power Inter-Integrated Circuit</description>
      <groupName>LPI2C</groupName>
      <baseAddress>0x40113800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x7F4</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="LPI2C0">
      <name>LPI2C4</name>
      <description>Low-Power Inter-Integrated Circuit</description>
      <groupName>LPI2C</groupName>
      <baseAddress>0x40171800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x7F4</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="LPI2C0">
      <name>LPI2C5</name>
      <description>Low-Power Inter-Integrated Circuit</description>
      <groupName>LPI2C</groupName>
      <baseAddress>0x40172800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x7F4</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="LPI2C0">
      <name>LPI2C6</name>
      <description>Low-Power Inter-Integrated Circuit</description>
      <groupName>LPI2C</groupName>
      <baseAddress>0x40173800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x7F4</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="LPI2C0">
      <name>LPI2C7</name>
      <description>Low-Power Inter-Integrated Circuit</description>
      <groupName>LPI2C</groupName>
      <baseAddress>0x40174800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x7F4</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="LPI2C0">
      <name>LPI2C8</name>
      <description>Low-Power Inter-Integrated Circuit</description>
      <groupName>LPI2C</groupName>
      <baseAddress>0x40199800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x7F4</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="LPI2C0">
      <name>LPI2C9</name>
      <description>Low-Power Inter-Integrated Circuit</description>
      <groupName>LPI2C</groupName>
      <baseAddress>0x4019A800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x7F4</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="LPI2C0">
      <name>LPI2C10</name>
      <description>Low-Power Inter-Integrated Circuit</description>
      <groupName>LPI2C</groupName>
      <baseAddress>0x4019B800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x7F4</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="LPI2C0">
      <name>LPI2C11</name>
      <description>Low-Power Inter-Integrated Circuit</description>
      <groupName>LPI2C</groupName>
      <baseAddress>0x4019C800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x7F4</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="LPI2C0">
      <name>LPI2C12</name>
      <description>Low-Power Inter-Integrated Circuit</description>
      <groupName>LPI2C</groupName>
      <baseAddress>0x4019D800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x7F4</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="LPI2C0">
      <name>LPI2C13</name>
      <description>Low-Power Inter-Integrated Circuit</description>
      <groupName>LPI2C</groupName>
      <baseAddress>0x4019E800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x7F4</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="LPI2C0">
      <name>LPI2C17</name>
      <description>Low-Power Inter-Integrated Circuit</description>
      <groupName>LPI2C</groupName>
      <baseAddress>0x40326800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x7F4</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="LPI2C0">
      <name>LPI2C18</name>
      <description>Low-Power Inter-Integrated Circuit</description>
      <groupName>LPI2C</groupName>
      <baseAddress>0x40327800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x7F4</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="LPI2C0">
      <name>LPI2C19</name>
      <description>Low-Power Inter-Integrated Circuit</description>
      <groupName>LPI2C</groupName>
      <baseAddress>0x40328800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x7F4</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="LPI2C0">
      <name>LPI2C20</name>
      <description>Low-Power Inter-Integrated Circuit</description>
      <groupName>LPI2C</groupName>
      <baseAddress>0x40329800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x7F4</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral>
      <name>SCT0</name>
      <description>SCTimer</description>
      <groupName>SCT</groupName>
      <baseAddress>0x40114000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x550</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CONFIG</name>
          <description>SCT Configuration</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1FE00</resetValue>
          <resetMask>0x7FFFF</resetMask>
          <fields>
            <field>
              <name>UNIFY</name>
              <description>SCT Operation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DUAL_COUNTER</name>
                  <description>Dual counters, COUNTER_L and COUNTER_H</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNIFIED_COUNTER</name>
                  <description>Unified counter</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKMODE</name>
              <description>SCT Clock Mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSTEM_CLOCK_MODE</name>
                  <description>System Clock mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLED_SYSTEM_CLOCK_MODE</name>
                  <description>Sampled System Clock mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCT_INPUT_CLOCK_MODE</name>
                  <description>SCT Input Clock mode</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCHRONOUS_MODE</name>
                  <description>Asynchronous mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CKSEL</name>
              <description>SCT Clock Select</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INPUT_0_RISING_EDGES</name>
                  <description>Rising edges on input 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUT_0_FALLING_EDGES</name>
                  <description>Falling edges on input 0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUT_1_RISING_EDGES</name>
                  <description>Rising edges on input 1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUT_1_FALLING_EDGES</name>
                  <description>Falling edges on input 1</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUT_2_RISING_EDGES</name>
                  <description>Rising edges on input 2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUT_2_FALLING_EDGES</name>
                  <description>Falling edges on input 2</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUT_3_RISING_EDGES</name>
                  <description>Rising edges on input 3</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUT_3_FALLING_EDGES</name>
                  <description>Falling edges on input 3</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUT_4_RISING_EDGES</name>
                  <description>Rising edges on input 4</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUT_4_FALLING_EDGES</name>
                  <description>Falling edges on input 4</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUT_5_RISING_EDGES</name>
                  <description>Rising edges on input 5</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUT_5_FALLING_EDGES</name>
                  <description>Falling edges on input 5</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUT_6_RISING_EDGES</name>
                  <description>Rising edges on input 6</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUT_6_FALLING_EDGES</name>
                  <description>Falling edges on input 6</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUT_7_RISING_EDGES</name>
                  <description>Rising edges on input 7</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUT_7_FALLING_EDGES</name>
                  <description>Falling edges on input 7</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NORELOAD_L</name>
              <description>No Reload Lower Match</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RELOAD</name>
                  <description>Reloaded</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_RELOAD</name>
                  <description>Not reloaded</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NORELOAD_H</name>
              <description>No Reload Higher Match</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RELOAD_H</name>
                  <description>Reloaded</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_RELOAD_H</name>
                  <description>Not reloaded</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INSYNC</name>
              <description>Input Synchronization</description>
              <bitOffset>9</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AUTOLIMIT_L</name>
              <description>Auto Limit Lower</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUTOLIMIT_H</name>
              <description>Auto Limit Higher</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
