Masmiseim36/nxpSDK/devices/MIMXRT758S/MIMXRT758S_ezhv.xml
        <register>
          <name>SR</name>
          <description>Status</description>
          <addressOffset>0x15C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x2000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BUSY</name>
              <description>Module Busy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTBUSY</name>
                  <description>Not busy</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUSY</name>
                  <description>Busy</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IP_ACC</name>
              <description>IP Access</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTIPBUS</name>
                  <description>Not initiated by IP bus</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPBUS</name>
                  <description>Initiated by IP bus</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AHB_ACC</name>
              <description>AHB Read Access</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTAHBBUS</name>
                  <description>Not initiated by AHB bus</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHBBUS</name>
                  <description>Initiated by AHB bus</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AWRACC</name>
              <description>AHB Write Access</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOACCESS</name>
                  <description>No AHB write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACCESS</name>
                  <description>AHB write access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AHBTRN</name>
              <description>AHB Access Transaction Pending</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOREQUEST</name>
                  <description>No pending request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQUEST</name>
                  <description>Request is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AHB0NE</name>
              <description>AHB Buffer 0 Not Empty</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMPTY</name>
                  <description>Empty</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTEMPTY</name>
                  <description>Not empty</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AHB1NE</name>
              <description>AHB Buffer 1 Not Empty</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMPTY</name>
                  <description>Empty</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTEMPTY</name>
                  <description>Not empty</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AHB2NE</name>
              <description>AHB Buffer 2 Not Empty</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMPTY</name>
                  <description>Empty</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTEMPTY</name>
                  <description>Not empty</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AHB3NE</name>
              <description>AHB Buffer 3 Not Empty</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMPTY</name>
                  <description>Empty</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTEMPTY</name>
                  <description>Not empty</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AHB0FUL</name>
              <description>AHB Buffer 0 Full</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTFULL</name>
                  <description>Not full</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FULL</name>
                  <description>Full</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AHB1FUL</name>
              <description>AHB Buffer 1 Full</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTFULL</name>
                  <description>Not full</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FULL</name>
                  <description>Full</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AHB2FUL</name>
              <description>AHB Buffer 2 Full</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTFULL</name>
                  <description>Not full</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FULL</name>
                  <description>Full</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AHB3FUL</name>
              <description>AHB Buffer 3 Full</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTFULL</name>
                  <description>Not full</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FULL</name>
                  <description>Full</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ARB_LCK</name>
              <description>Arbitration Lock Status</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_LOCKED</name>
                  <description>Not locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED</name>
                  <description>Locked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXWE</name>
              <description>RX Buffer Watermark Exceeded</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_EXCEEDED</name>
                  <description>Not exceeded</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXCEEDED</name>
                  <description>Exceeded</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXFULL</name>
              <description>RX Buffer Full</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_FULL</name>
                  <description>Not full</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FULL</name>
                  <description>Full</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ARB_STATE</name>
              <description>XSPI Arbitration State</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>Idle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARBITRATION</name>
                  <description>ARB - Arbitration</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHB_WRITE</name>
                  <description>AHBWR_PROC - AHB write processing</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHB_READ</name>
                  <description>AHBRD_PROC - AHB read processing</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SFP_IPS_TG_STATE</name>
                  <description>TG_PROC - IP command processing</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHB_READ_WRITE</name>
                  <description>PROC_FIN - XSPI processing finish wait</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDSR_READ</name>
                  <description>RDSR_PROC - RDSR read processing</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXDMA</name>
              <description>RX Buffer DMA</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_DMA</name>
                  <description>Not active</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA</name>
                  <description>Active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXNE</name>
              <description>TX Buffer Not Empty</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMPTY</name>
                  <description>Empty</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTEMPTY</name>
                  <description>Not empty</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXWA</name>
              <description>TX Buffer Watermark Available</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_AVAILABLE</name>
                  <description>Not available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVAILABLE</name>
                  <description>Available</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXDMA</name>
              <description>TX DMA</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disabled or not processing the DMA request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enabled and processing DMA request</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXFULL</name>
              <description>TX Buffer Full</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_FULL</name>
                  <description>Not full</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FULL</name>
                  <description>Full</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
