Masmiseim36/nxpSDK/devices/MIMXRT758S/MIMXRT758S_ezhv.xml
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>RR[%s]</name>
          <description>Receive</description>
          <addressOffset>0x280</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RR_DATA</name>
              <description>MUA Receive Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="MU0_MUA">
      <name>MU0_MUB</name>
      <description>Messaging Unit</description>
      <groupName>MU</groupName>
      <baseAddress>0x40201000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x290</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="MU0_MUA">
      <name>MU1_MUA</name>
      <description>Messaging Unit</description>
      <groupName>MU</groupName>
      <baseAddress>0x40202000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x290</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="MU0_MUA">
      <name>MU1_MUB</name>
      <description>Messaging Unit</description>
      <groupName>MU</groupName>
      <baseAddress>0x40203000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x290</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="MU0_MUA">
      <name>MU2_MUA</name>
      <description>Messaging Unit</description>
      <groupName>MU</groupName>
      <baseAddress>0x40204000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x290</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="MU0_MUA">
      <name>MU2_MUB</name>
      <description>Messaging Unit</description>
      <groupName>MU</groupName>
      <baseAddress>0x40205000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x290</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="MU0_MUA">
      <name>MU3_MUA</name>
      <description>Messaging Unit</description>
      <groupName>MU</groupName>
      <baseAddress>0x40319000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x290</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="MU0_MUA">
      <name>MU3_MUB</name>
      <description>Messaging Unit</description>
      <groupName>MU</groupName>
      <baseAddress>0x4031A000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x290</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral>
      <name>OSTIMER_CPU0</name>
      <description>OS Event Timer</description>
      <groupName>OSTIMER</groupName>
      <headerStructName>OSTIMER</headerStructName>
      <baseAddress>0x40207000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x20</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>EVTIMERL</name>
          <description>EVTIMER Low</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EVTIMER_COUNT_VALUE</name>
              <description>EVTimer Count Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EVTIMERH</name>
          <description>EVTIMER High</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EVTIMER_COUNT_VALUE</name>
              <description>EVTimer Count Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAPTURE_L</name>
          <description>Local Capture Low for CPU</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CAPTURE_VALUE</name>
              <description>EVTimer Capture Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAPTURE_H</name>
          <description>Local Capture High for CPU</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CAPTURE_VALUE</name>
              <description>EVTimer Capture Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MATCH_L</name>
          <description>Local Match Low for CPU</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MATCH_VALUE</name>
              <description>EVTimer Match Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MATCH_H</name>
          <description>Local Match High for CPU</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MATCH_VALUE</name>
              <description>EVTimer Match Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSEVENT_CTRL</name>
          <description>OSTIMER Control for CPU</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OSTIMER_INTRFLAG</name>
              <description>Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>OSTIMER_INTENA</name>
              <description>Interrupt or Wake-Up Request</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTERRUPTS_BLOCKED</name>
                  <description>Interrupts blocked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERRUPTS_ENABLED</name>
                  <description>Interrupts enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MATCH_WR_RDY</name>
              <description>EVTimer Match Write Ready</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DEBUG_EN</name>
              <description>Debug Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
