Masmiseim36/nxpSDK/devices/MIMXRT758S/MIMXRT758S_ezhv.xml
        <register>
          <name>POWERCFG</name>
          <description>Power Configuration</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x60000070</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FDSCP1PD</name>
              <description>SCPC VDD1 Power Down in FDSR Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FDSCP1PD_DIS</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDSCP1PD_EN</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FDSCP2PD</name>
              <description>SCPC VDD2 Power Down in FDSR Mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FDSCP2PD_DIS</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDSCP2PD_EN</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FDLDO1PD</name>
              <description>LDO VDD1 Power Down in FDSR Mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FDLDO1PD_DIS</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDLDO1PD_EN</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FDLDO2PD</name>
              <description>LDO VDD2 Power Down in FDSR Mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FDLDO2PD_DIS</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDLDO2PD_EN</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FDDCPD</name>
              <description>DCDC Power Down in FDSR Mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FDDCPD_DIS</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDDCPD_EN</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCPCPD</name>
              <description>SCPC Power Down</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCPCPD_DIS</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCPCPD_EN</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDO1PD</name>
              <description>LDO VDD1 Power Down</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LDO1PD_DIS</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO1PD_EN</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDO2PD</name>
              <description>LDO VDD2 Power Down</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LDO2PD_DIS</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO2PD_EN</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCDCPD</name>
              <description>DCDC Power Down</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCDCPD_DIS</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCDCPD_EN</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FDPDBGLP</name>
              <description>Force Band Gap during FDPD Mode to LP Mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HP</name>
                  <description>Enables band gap to high-power mode during FDPD mode and wakes up if VDD1V8 POR is asserted then negated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LP</name>
                  <description>Enables band gap to low-power mode during FDPD mode and will not wake up on VDD1V8 POR negation. RTC, INTR, or reset is used as wake-up</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODEDLY</name>
              <description>Mode Delay</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DLY_0</name>
                  <description>250 ns</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY_1</name>
                  <description>500 ns</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY_2</name>
                  <description>1000 ns</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY_3</name>
                  <description>2000 ns</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY_4</name>
                  <description>4000 ns</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY_5</name>
                  <description>8000 ns</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY_6</name>
                  <description>16 us</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY_7</name>
                  <description>32 us</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY_8</name>
                  <description>64 us</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY_9</name>
                  <description>128 us</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY_10</name>
                  <description>256 us</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY_11</name>
                  <description>512 us</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY_12</name>
                  <description>1024 us</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY_13</name>
                  <description>2048 us</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY_14</name>
                  <description>4096 us</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY_15</name>
                  <description>8192 us</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PADVRANGE</name>
          <description>3 V Capable VDDIO Range Select</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VRANGE</name>
              <description>3 V Capable IO Bank VDDIO Range Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Cont</name>
                  <description>Continuous mode. Allows 1.71 - 3.6 V range but consumes static current.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1p8</name>
                  <description>1.71 - 1.98 V, supply detector off</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V3p3</name>
                  <description>3.00 - 3.6 V, supply detector off</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PADCFG</name>
          <description>IO Bank State Configuration</description>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ISOCTRL</name>
              <description>IO bank State Retain Control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoRetain</name>
                  <description>IO bank is controllable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Port013</name>
                  <description>Port 0/1/3 is in retain mode</description>
                  <value>#xxxxxxx1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISOHOLD</name>
              <description>IO Bank Isolation Hold</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoRetain</name>
                  <description>IO bank is controllable on wake-up from FDSR/DPD mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Port013</name>
                  <description>Port 0/1/3 is retained/isolated on wake-up from FDSR/DPD mode. Software must clear [ISOCTRL] bit 0 to regain control</description>
                  <value>#xxxxxxx1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSTCTRL</name>
              <description>Reset Control</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>noreset</name>
                  <description>IO banks are not reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Port013</name>
                  <description>Port 0/1/3 reset = tristate</description>
                  <value>#xxxxxxx1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
