Masmiseim36/nxpSDK/devices/MIMXRT758S/MIMXRT758S_ezhv.xml
        <register>
          <name>USB1_VBUS_DETECT</name>
          <description>USBPHY VBUS Detect Control</description>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x700004</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VBUSVALID_THRESH</name>
              <description>VBUSVALID Threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VOLT_4</name>
                  <description>4.0 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VOLT_4P1</name>
                  <description>4.1 V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VOLT_4P2</name>
                  <description>4.2 V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VOLT_4P3</name>
                  <description>4.3 V</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VOLT_4P4</name>
                  <description>4.4 V</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VOLT_4P5</name>
                  <description>4.5 V</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VOLT_4P6</name>
                  <description>4.6 V</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VOLT_4P7</name>
                  <description>4.7 V</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VBUS_OVERRIDE_EN</name>
              <description>VBUS Detect Signal Override Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTERNAL</name>
                  <description>Results of VBUS_VALID and session valid comparators for VBUS_VALID, AVALID, BVALID, and SESSEND</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OVERRIDE</name>
                  <description>Override values for VBUS_VALID, AVALID, BVALID, and SESSEND</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SESSEND_OVERRIDE</name>
              <description>Override Value for SESSEND</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OVERRIDE_0</name>
                  <description>Overridden to 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OVERRIDE_1</name>
                  <description>Overridden to 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BVALID_OVERRIDE</name>
              <description>Override Value for B-Device Session Valid</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OVERRIDE_0</name>
                  <description>Overridden to 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OVERRIDE_1</name>
                  <description>Overridden to 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AVALID_OVERRIDE</name>
              <description>Override Value for A-Device Session Valid</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OVERRIDE_0</name>
                  <description>Overridden to 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OVERRIDE_1</name>
                  <description>Overridden to 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VBUSVALID_OVERRIDE</name>
              <description>Override Value for the VBUS_VALID Signal</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OVERRIDE_0</name>
                  <description>Overridden to 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OVERRIDE_1</name>
                  <description>Overridden to 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VBUSVALID_SEL</name>
              <description>VBUS_VALID Source Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMP</name>
                  <description>VBUS_VALID comparator results</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DET_3V</name>
                  <description>VBUS_VALID_3V detector results</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VBUS_SOURCE_SEL</name>
              <description>VBUS_VALID Source Selection</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VBUS_VALID_COMP</name>
                  <description>VBUS_VALID comparator results</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SESSION_VALID_COMP</name>
                  <description>Session valid comparator results</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SESSION_VALID_COMP_1</name>
                  <description>Session valid comparator result</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VBUSVALID_TO_SESSVALID</name>
              <description>VBUS_VALID Comparator Selection</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VBUS_VALID</name>
                  <description>VBUS_VALID comparator for the VBUS_VALID results</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SESSION_VALID</name>
                  <description>Session end comparator for the VBUS_VALID results</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRUP_CMPS</name>
              <description>VBUS_VALID Comparator Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable the VBUS_VALID comparator</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable the SESS_VALID comparator</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDETECT</name>
                  <description>Enable 3V detection</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISCHARGE_VBUS</name>
              <description>VBUS Discharge Resistor Controller</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EN_CHARGER_RESISTOR</name>
              <description>Charger Resistor Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USB1_VBUS_DETECT_SET</name>
          <description>USBPHY VBUS Detect Control</description>
          <addressOffset>0xC4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x700004</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToSet</modifiedWriteValues>
          <fields>
            <field>
              <name>VBUSVALID_THRESH</name>
              <description>VBUSVALID Threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>VBUS_OVERRIDE_EN</name>
              <description>VBUS Detect Signal Override Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>SESSEND_OVERRIDE</name>
              <description>Override Value for SESSEND</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>BVALID_OVERRIDE</name>
              <description>Override Value for B-Device Session Valid</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>AVALID_OVERRIDE</name>
              <description>Override Value for A-Device Session Valid</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>VBUSVALID_OVERRIDE</name>
              <description>Override Value for the VBUS_VALID Signal</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>VBUSVALID_SEL</name>
              <description>VBUS_VALID Source Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>VBUS_SOURCE_SEL</name>
              <description>VBUS_VALID Source Selection</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>VBUSVALID_TO_SESSVALID</name>
              <description>VBUS_VALID Comparator Selection</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>PWRUP_CMPS</name>
              <description>VBUS_VALID Comparator Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>DISCHARGE_VBUS</name>
              <description>VBUS Discharge Resistor Controller</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>EN_CHARGER_RESISTOR</name>
              <description>Charger Resistor Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USB1_VBUS_DETECT_CLR</name>
          <description>USBPHY VBUS Detect Control</description>
          <addressOffset>0xC8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x700004</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>VBUSVALID_THRESH</name>
              <description>VBUSVALID Threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>VBUS_OVERRIDE_EN</name>
              <description>VBUS Detect Signal Override Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>SESSEND_OVERRIDE</name>
              <description>Override Value for SESSEND</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>BVALID_OVERRIDE</name>
              <description>Override Value for B-Device Session Valid</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>AVALID_OVERRIDE</name>
              <description>Override Value for A-Device Session Valid</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>VBUSVALID_OVERRIDE</name>
              <description>Override Value for the VBUS_VALID Signal</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>VBUSVALID_SEL</name>
              <description>VBUS_VALID Source Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>VBUS_SOURCE_SEL</name>
              <description>VBUS_VALID Source Selection</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>VBUSVALID_TO_SESSVALID</name>
              <description>VBUS_VALID Comparator Selection</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>PWRUP_CMPS</name>
              <description>VBUS_VALID Comparator Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>DISCHARGE_VBUS</name>
              <description>VBUS Discharge Resistor Controller</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>EN_CHARGER_RESISTOR</name>
              <description>Charger Resistor Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
