Masmiseim36/nxpSDK/devices/MIMXRT758S/MIMXRT758S_ezhv.xml
        <register>
          <name>SBUSCFG</name>
          <description>System Bus Configuration</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AHBBRST</name>
              <description>AHB Manager Interface Burst Configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INCR_BURST</name>
                  <description>Incremental burst of unspecified length only</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR4_BURST</name>
                  <description>INCR4 burst, then single transfer</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR8_BURST</name>
                  <description>INCR8 burst, INCR4 burst, then single transfer</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR16_BURST</name>
                  <description>INCR16 burst, INCR8 burst, INCR4 burst, then single transfer</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR4_UNSPEC</name>
                  <description>INCR4 burst, then incremental burst of unspecified length</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR8_4_UNSPEC</name>
                  <description>INCR8 burst, INCR4 burst, then incremental burst of unspecified length</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR16_8_4_UNSPEC</name>
                  <description>INCR16 burst, INCR8 burst, INCR4 burst, then incremental burst of unspecified length</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CAPLENGTH</name>
          <description>Capability Registers Length</description>
          <addressOffset>0x100</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x40</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>CAPLENGTH</name>
              <description>Capability Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HCIVERSION</name>
          <description>Host Controller Interface Version</description>
          <addressOffset>0x102</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x100</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>HCIVERSION</name>
              <description>Host Controller Interface Version Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HCSPARAMS</name>
          <description>Host Controller Structural Parameters</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x10011</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>N_PORTS</name>
              <description>Number of Ports</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PPC</name>
              <description>Port Power Control</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_SWITCHES</name>
                  <description>No port power switches</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_SWITCHES</name>
                  <description>Port power switches exist</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>N_PCC</name>
              <description>Number of Ports per Companion Controller</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>N_CC</name>
              <description>Number of Companion Controller (N_CC)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_COMP_CONTROLLER</name>
                  <description>No internal companion controller exists</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_CONTROLLER</name>
                  <description>Internal companion controllers exist</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PI</name>
              <description>Port Indicators (P_INDICATOR)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>N_PTT</name>
              <description>Number of Ports per Transaction Translator (N_PTT)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>N_TT</name>
              <description>Number of Transaction Translators (N_TT)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HCCPARAMS</name>
          <description>Host Controller Capability Parameters</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x6</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADC</name>
              <description>Addressing Capability</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PFL</name>
              <description>Programmable Frame List Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ASP</name>
              <description>Asynchronous Schedule Park Capability</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IST</name>
              <description>Isochronous Scheduling Threshold</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EECP</name>
              <description>EHCI Extended Capabilities Pointer</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCIVERSION</name>
          <description>Device Controller Interface Version</description>
          <addressOffset>0x120</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DCIVERSION</name>
              <description>Device Controller Interface Version Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCPARAMS</name>
          <description>Device Controller Capability Parameters</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x188</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DEN</name>
              <description>Device Endpoint Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_DEN</name>
                  <description>Not device capable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEN</name>
                  <description>Device capable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DC</name>
              <description>Device Capable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_DC</name>
                  <description>Not device capable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DC</name>
                  <description>Device capable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HC</name>
              <description>Host Capable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_HC</name>
                  <description>Not host capable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HC</name>
                  <description>Host capable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USBCMD</name>
          <description>USB Command</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RS</name>
              <description>Run/Stop</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>Stopped executing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN</name>
                  <description>Running</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RST</name>
              <description>Controller Reset</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FS_1</name>
              <description>Frame List Size 1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PSE</name>
              <description>Periodic Schedule Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DONT_PROCESS_PT</name>
                  <description>Do not process the periodic schedule</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROCESS_PT_PERIODICLISTBASE</name>
                  <description>Process the periodic schedule</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ASE</name>
              <description>Asynchronous Schedule Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DONT_PROCESS_ASYNC</name>
                  <description>Do not process the asynchronous schedule</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACCESS_ASYNC</name>
                  <description>Access the asynchronous schedule</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IAA</name>
              <description>Interrupt on Async Advance Doorbell</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ASP</name>
              <description>Asynchronous Schedule Park Mode Count</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ASPE</name>
              <description>Asynchronous Schedule Park Mode Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SUTW</name>
              <description>Setup Trip Wire (Device mode only)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATDTW</name>
              <description>Add dTD Trip Wire (Device mode only)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FS_2</name>
              <description>Frame List Size 2 (Host mode only)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ITC</name>
              <description>Interrupt Threshold Control</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IMMEDIATE</name>
                  <description>Immediate (no threshold)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MICROFRAME_1</name>
                  <description>1 microframe</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MICROFRAME_2</name>
                  <description>2 microframes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MICROFRAME_4</name>
                  <description>4 microframes</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MICROFRAME_8</name>
                  <description>8 microframes</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MICROFRAME_16</name>
                  <description>16 microframes</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MICROFRAME_32</name>
                  <description>32 microframes</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MICROFRAME_64</name>
                  <description>64 microframes</description>
                  <value>0x40</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
